import Header from "../../../components/header/Header";
import Footer from "../../../components/footer/Footer";
import { Card, Row, Col, Container, ListGroup } from "react-bootstrap";
import { Link } from "react-router-dom";
import image from "../../../assets/images/Shabake.jpg";
function Electrotechnic() {
  return (
    <>
      <Header />
      <Container>
        <Row>
          <Col sm={12} md={4} lg={3} className="my-3">
            <Card className="bg-info fixed-style">
              <ListGroup variant="flush">
                <ListGroup.Item>
                  <Link
                    className="text-decoration-none text-dark"
                    target="blank"
                    to={"/accounting"}
                  >
                    رشته حسابداری
                  </Link>
                </ListGroup.Item>
                <ListGroup.Item>
                  <Link
                    className="text-decoration-none text-dark"
                    target="blank"
                    to={"/electrotechnic"}
                  >
                    رشته شبکه و نرم افزار
                  </Link>
                </ListGroup.Item>
                <ListGroup.Item>
                  <Link
                    className="text-decoration-none text-dark"
                    target="blank"
                    to={"/teachers"}
                  >
                    هنرآموزان
                  </Link>
                </ListGroup.Item>
                <ListGroup.Item>
                  <Link
                    className="text-decoration-none text-dark"
                    target="blank"
                    to={"/honors"}
                  >
                    افتخارات
                  </Link>
                </ListGroup.Item>
                <ListGroup.Item>
                  <Link
                    className="text-decoration-none text-dark"
                    target="blank"
                    to={"/aboutUs"}
                  >
                    درباره هنرستان
                  </Link>
                </ListGroup.Item>
              </ListGroup>
            </Card>
          </Col>
          <Col sm={12} md={8} lg={9} className="my-3">
            <h2 className="p-5 fw-bold">رشته الکتروتکنیک</h2>
            <div className="text-center">
              <img src={image} alt="" className="img-fluid rounded shadow" />
            </div>
            <p className="p-5 text-justify my-4">
              رشته الکتروتکنیک درباره بکارگیری انرژی الکتریکی در مصارف خانگی و
              صنعتی است. توسعه پایدار و حیات اقتصادی هر کشور به میزان تولید
              انرژی الکتریکی آن بستگی دارد و هر نوع فعالیت صنعتی، تولیدی، خدماتی
              و اقتصادی بدون استفاده از این انرژی میسر نیست.
              <br />
              <br />
              رشته الکتروتکنیک نقش اساسی در اجرای کلیه عملیات و انجام فرایندها
              دارد. این رشته کاملا با رشته الکترونیک متفاوت است. هر کشوری برای
              توسعه و پیشرفت خود نیاز به تولید انرژی برق و توسعه آن در سراسر
              کشور دارد که تمام واحد های صنعتی، تولیدی و خدماتی و … در تمام امور
              آن کشور از این طریق بتوانند از انرژی برق استفاده کنند.
              <br />
              <br />
              <h4 className="py-3 fw-bold">
                تفاوت رشته الکترونیک و الکتروتکنیک
              </h4>
              هردو رشته الکترونیک و الکتروتکنیک جزو شاخه های پرطرفدار برق هستند
              که افرادی که در زمینه برق علاقه مند به تحصیل و کسب تخصص هستند در
              صورت داشتن اطلاعات کافی در رابطه با الکترونیک و الکتروتکنیک می
              توانند انتخاب درستی را داشته باشند.
              <br />
              <br />
              الکترونیک به بخش یا شاخه ای گفته می‌شود که اکثرا افراد اقدام به
              بررسی تخصصی و بیشتر مدارهای الکترونیکی و یا بردهای الکترونیکی می
              کنند، یا با جریان ها و ولتاژها در زمینه مقاومت ها و دیودها سر و
              کار دارند.
              <br />
              <br />
              و همچنین بررسی و استفاده از قطعات الکترونیکی خاص مانند انواع خازن
              و مقاومت ها ترانزیستور ها و غیره بیشتر مورد توجه هست
              <br />و به گونه‌ای نیازمند توجه و ظرافت خاص می‌باشد و افرادی که
              دقت کاری آن ها بیشتر بوده و ریزبین هستند ، می‌توانند در این زمینه
              مشغول به تحصیل شوند .
              <br />
              ولی الکتروتکنیک بخش دیگری از برق است که در آن معمولاً مدار هایی با
              ولتاژ و قدرت بالا مورد بررسی و آنالیز قرار می گیرند.
              <br />و بیشتر قطعات خاصی مانند انواع کابل ها، موتورهای الکتریکی،
              تابلو برق های بزرگ و صنعتی مورد بررسی قرار می‌گیرند.
              <br />
              <br />
              بسیاری از دانش آموزان به این رشته علاقه دارند و قصد دارند مهارت
              خود را در این رشته بالا ببرند. پس بدین منظور برای تحصیلی و کسب
              مهارت در این رشته شما رشته الکتروتکنیک را در هنرستان انتخاب می
              کنید .<h5 className="p-3">لیست دروس رشته الکتروتکنیک</h5>
            </p>
            <Row className="px-5">
              {/* پایه دهم */}
              <Col sm={12} md={4} className="p-2">
                <Card className="bg-info fixed-style">
                  <Card.Header className="text-dark">پایه دهم :</Card.Header>
                  <ListGroup variant="flush">
                    <ListGroup.Item className="p-3">
                      دانش فنی پایه الکتروتکنیک
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      طراحی و سیم کشی برق
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      ساختمان های مسکونی
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      طراحی و نصب تاسیسات جریان ضعیف
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      کتاب همراه هنرجو
                    </ListGroup.Item>
                  </ListGroup>
                </Card>
              </Col>
              {/* پایه یازدهم */}
              <Col sm={12} md={4} className="p-2">
                <Card className="bg-info fixed-style">
                  <Card.Header className="text-dark">پایه یازدهم :</Card.Header>
                  <ListGroup variant="flush">
                    <ListGroup.Item className="p-3">
                      طراحی و نصب تاسیسات
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      حفاظتی و ساختمان های هوشمند
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      کابل کشی و سیم پیچی
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      ماشین های الکتریکی
                    </ListGroup.Item>
                  </ListGroup>
                </Card>
              </Col>
              {/* پایه دوازدهم */}
              <Col sm={12} md={4} className="p-2">
                <Card className="bg-info fixed-style">
                  <Card.Header className="text-dark">
                    پایه دوازدهم :
                  </Card.Header>
                  <ListGroup variant="flush">
                    <ListGroup.Item className="p-3">
                      نصب و تنظیم تابلوهای
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      برق فشار ضعیف
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      دانش فنی تخصصی الکتروتکنیک
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      طراحی و اجرای رله های قابل برنامه ریزی{" "}
                    </ListGroup.Item>
                  </ListGroup>
                </Card>
              </Col>
            </Row>
            <p className="px-5 pt-3">
              برای ورود به دانشگاه هم می توانید در آزمون کاردانی شرکت کنید و در
              یکی از گرایش های این رشته ادامه تحصیل دهید.
              <br />
              <br />
              <b>توانایی های مورد نیاز رشته الکتروتکنیک هنرستان</b>
              <br />
              <br />
              مهندسی برق نیز مانند مابقی رشته های مهندسی بر اصول ریاضیات و
              مفاهیم فیزیکی استوار است و هرچه دانش آموزان بهتر این مفاهیم را درک
              کنند، می توانند مهندس بهتری باشند. داشتن ضریب هوشی بالا و تسلط
              کافی بر ریاضیات، فیزک و زبان خارجی از ضرورتهای ورود به این رشته
              است. دانش آموختگان در این رشته باید ذهنی خلاق و تحلیل گر داشته
              باشند و به کار کردن با برق نیز علاقه مند باشند. زیرا گاهی کسانی را
              می بینیم که در ریاضیات و فیزیک بسیار قوی هستند ولی در کارهای عملی
              خیلی قوی نمی توانند عمل کنند.
              <br />
              <br />
              <b>وسایل مورد نیاز برای این رشته</b>
              <br />
              <br />
              معمولا در رشته های هنرستان به جز کتاب ها و جزوه های درسی به وسایلی
              به غیر از کتاب و دفتر نیاز است. رشته الکتروتکنیک نیز از این قاعده
              مستثنی نیست. در این رشته درسی داریم به نام درس رسم فنی که به رسم
              مدارات ساختمانی و و الکتریکی مربوط می شود که برای انجام این کار به
              تخته رسم و خط کش نیاز است. یا مثلا برای کار های کارگاهی شما نیاز
              به لباس کارگاه دارید که یا خودتون آن را تهیه می کنید یا مسئول
              کارگاه برای بچه ها تهیه کرده و هزینه آن را خود بچه ها پرداخت می
              کنند یا وسیله ای دیگر به اسم مولتی متر نیز مورد استفاده قرار می
              گیرد که ممکن است به شما گفته شود که آن را نیز تهیه کنید.
              <br />
              <br />
              <b>بازار کار رشته الکتروتکنیک هنرستان</b>
              <br />
              <br />
              انرژی یکی از ارکان اصلی اقتصاد است و در این میان برق به عنوان عالی
              ترین نوع انرژی جایگاه ویژه ای دارد. یک مهندس خوب می تواند یک
              کارآفرین بسیار خوبی باشد یعنی صرفا به دنبال استخدام در یک شرکت یا
              ارگان خصوصی یا دولتی نباشد بلکه با توجه به نیاز جامعه و آگاهی ها و
              تجربه های خود نیازهای فنی و صنعتی کشور را یافته و با طراحی مدارها
              و سیستم های خاصی این نیازها را برطرف سازد. امروزه بسیاری از فارغ
              التحصیلان این کار را انجام داده اند که بسیار هم موفق بوده اند.
              <br />
              <br />
              اگر یک فارغ التحصیل الکتروتکنیک دارای توانایی های لازم باشد هرگز
              با مشکل بیکاری روبه رو نخواهد شد .
              <br />
              <br />
              <b>زمینه ها و عناوین شغلی رشته الکتروتکنیک هنرستان</b>
            </p>
            <Row className="px-5 py-3">
              <Col sm={12} className="p-2">
                <Card className="bg-info fixed-style">
                  <Card.Header className="text-dark">
                    زمینه ها و عناوین شغلی که اگر رشته الکتروتکنیک را برای ادامه
                    تحصیل خود انتخاب کنید می توانید در آن مشغول به کار شوید شامل
                    عناوین زیر است :
                  </Card.Header>
                  <ListGroup variant="flush">
                    <ListGroup.Item className="p-3">
                      نقشه کشی و نقشه خوانی برق مقدماتی و پیشرفته
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      برقکار ساختمان به صورت مقدماتی و پیشرفته
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      نصاب و تعمیرکار تابلوهای برق ساختمان
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      نصاب و تعمیرکار پله برقی و پیاده روی برقی
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      برقکار وسایل نقلیه پیشرفته
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      برقکار وسایل حمل و نقل مقدماتی، زمینی و هوایی
                    </ListGroup.Item>
                  </ListGroup>
                </Card>
              </Col>
            </Row>
            <p className="px-5 py-3 text-justify">
              اگر بخواهیم مشاغل این رشته را دسته بندی کنیم می توان آن را به دو
              دسته تقسیم کنیم. دسته اول شغل هایی که با عنوان برقکار عمومی شناخته
              می‌شوند. مثل برقکاری ساختمان و نقشه کشی برق و تابلو سازی برق و
              دسته دوم شغل هایی است که به آن برقکار صنعتی گفته می شود که شامل
              شغل هایی مثل تابلوسازی فشار قوی، سیم پیچی موتورهای الکتریکی و راه
              اندازی آنها و مشاغلی شبیه به این‌هاست .
              <br />
              <br />
              <b>
                آینده شغلی رشته الکتروتکنیک را می‌توان به طور کلی به دو بخش
                خصوصی و دولتی تقسیم کرد.
              </b>
              <br />
              <br />
              در بخش دولتی، سازمان‌ها و ارگان‌های بسیاری نیازمند تخصص شما در
              رشتۀ الکتروتکنیک هستند. از یک سو وزارت نیرو را داریم که اصلی‌ترین
              مأموریتش تولید، انتقال و توزیع برق به سراسر کشور و حتی صادر نمودن
              به سایر کشورها است. علاوه بر این در تمامی سازمان‌های وابسته به
              صنایع مانند پالایشگاه‌ها، تولید فلزات، صنایع پتروشیمی، گاز و
              بسیاری صنایع دیگر به رشتۀ الکتروتکنیک نیاز است. حتی در ساختمان‌های
              دولتی در حال ساخت یا ساخته شده در موارد بی شماری نیاز به این تخصص
              وجود دارد.
              <br />
              <br />
              در بخش خصوصی نیز در تمامی صنایع موقعیت اشتغال وجود دارد. در واقع
              به شما توصیه می‌کنیم زیاد به فکر پیدا کردن شغل نباشید، و تنها بر
              بالا بردن مهارت‌هایتان تمرکز کنید. شغل برای شما بسیار است.
              <br />
              <br />
              مسئلۀ اصلی این است که شما بتوانید حداقل یکی از مهارت‌هایی را که در
              بالا گفته شد به طور کامل کسب کنید. یعنی دانش تئوری و محاسباتی آن
              را داشته باشید، ابزارها را بشناسید، و توانایی انجام کار را داشته
              باشید. در این صورت نباید هیچ نگرانی برای پیدا کردن شغل داشته
              باشید.
              <br />
              <br />
              امروزه معدود فارغ التحصیلانی در این رشته در کشور وجود دارند که بی
              کار هستند اما دلیل این موضوع کمبود کار در کشور نیست بلکه دلیل
              بسیاری از این بیکاری ها نداشتن دانش لازم و تجربه‌ی کافی است. دو
              موضوع دانش و مهارت لازمه‌ی استخدام و یا وارد شدن در بازار کار این
              رشته میباشد.
            </p>
            <Row className="px-5 py-3">
              <Col sm={12} className="p-2">
                <Card className="bg-info fixed-style">
                  <Card.Header className="text-dark">
                    گرایش‌های این رشته عبارتنداز:
                  </Card.Header>
                  <ListGroup variant="flush">
                    <ListGroup.Item className="p-3">کنترل</ListGroup.Item>
                    <ListGroup.Item className="p-3">
                      انتقال و توزیع
                    </ListGroup.Item>
                    <ListGroup.Item className="p-3">قدرت </ListGroup.Item>
                  </ListGroup>
                </Card>
              </Col>
            </Row>
            <p className="px-5 py-3 text-justify">
              توانایی های یک مهندس و فارغ التحصیل رشته الکتروتکنیک بسیار گسترده
              می‌باشد.
              <br />
              <br />
              به همین منظور یک فارغ التحصیل رشته الکتروتکنیک میتواند در بخش های
              خصوصی و دولتی فعالیت های زیادی داشته باشد به عنوان مثال در بخش
              خصوصی یک فارغ التحصیل رشته الکتروتکینک میتواند یک مغازه‌ی الکتریکی
              و یا یک تکنسین برق برای یک ساختمان نیم کاره باشد و یا تولید کننده
              تابلو های برق صنعتی باشد.
              <br />
              که البته تمام این موارد در بخش خصوصی است اما در بخش عمومی یک مهندس
              برق میتواند در نیروگاه های برق ، واحد های توزیع برق و یا قسمت های
              مختلف یک واحد مولد برق باشد.
            </p>
          </Col>
        </Row>
      </Container>
      <Footer />
    </>
  );
}
export default Electrotechnic;
